a1 = [3 -5 2 1]';
a2 = [1 1 0 -5]';
a3 = [-1 3 1 3]';
a4 = [2 -4 -1 -3]';

a = [a1 a2 a3 a4];

ra = rank(a);
% r = 4
ab = rref(r);
% b =
% 1   0   0   0
% 0   1   0   0
% 0   0   1   0
% 0   0   0   1

% 由此可得，秩为4, a1 a2 a3 a4为一个极大无关向量组。

b1 = [2 1 3 0]';
b2 = [0 2 -1 0]';
b3 = [14 7 0 3]';
b4 = [4 2 -1 1]';
b5 = [6 5 1 2]';

b = [b1 b2 b3 b4 b5];
rb = rank(b);
% rb = 4
bb = rref(b);
%% bb =
%% 1.00   0.00   0.00  -0.33   0.00
%% 0.00   1.00   0.00   0.00   0.00
%% 0.00   0.00   1.00   0.33   0.00
%% 0.00   0.00   0.00   0.00   1.00

% 由此可见秩为4，b1 b2 b3 b5为一个极大无关向量组
clear
A1 = [2 2 -2;
      2 3 0;
      -2 0 1];
A2 = [0 1 1;
      1 0 1;
      1 1 0];

A3 = [1 -2 -4;
      -2 4 -2;
      -4 -2 1];

syms y1 y2 y3
y = [y1; y2; y3];


[P1, D1] = eig(A1);
[P2, D2] = eig(A2);
[P3, D3] = eig(A3);
x1 = P1*y;
f1 = [y1 y2 y3]*D1*y;
x2 = P2*y;
f2 = [y1 y2 y3]*D2*y;
x3 = P3*y;
f3 = [y1 y2 y3]*D3*y;

B1 = [-2 1 1;
      1 -6 0;
      1 0 -4];
B2 = [1 -1 2;
      -1 3 0;
      2 0 9];

D1 = eig(B1);
D2 = eig(B2);
D = [D1 D2];
for d = 1:2
  if all(D(d)>0)
    fprintf('二次型正定\n')
  elseif all(D(d)<0)
    fprintf('二次型负定\n')
  else
    fprintf('二次型不定\n')
  end
